{
  "Menu": {
    "Trayectoria": "Career",
    "Sobre Mi": "About",
    "Proyectos": "Projects"
  },
  "TiempodeVida": {
    "Edad": "Age"
  },
  "Experiencia": {
    "title": "Experience"
  },
  "EXPERIENCE": [
    {
      "id": 1,
      "date": "JANUARY 2024",
      "title": "Content Creator - Programming",
      "description": "Generate content in the field of programming, teaching how to create engaging and eye-catching projects to attract more people to the fascinating world of programming."
    },
    {
      "id": 2,
      "date": "December 2023",
      "title": "Full Stack Project - Ecommerce - MongoDb",
      "description": "Led the development of the frontend side of the project, ensuring an attractive interface for the client. Implemented a CRUD system for managing client data, created APIs to facilitate communication between frontend and backend, and selected key libraries for the project's success."
    },
    {
      "id": 3,
      "date": "October 2023",
      "title": "Full Stack Career - CODERHOUSE",
      "description": "Completed the Full Stack Career at Coderhouse, acquiring a solid foundation in Frontend and Backend development. Now, I am focused on perfecting the skills provided during the training."
    }
  ],
  "Presentacion": {
    "presentation": "Hey,I'm Edu",
    "subtitle": "Programmer Full Stack",
    "description": "Full stack web developer with experience in web application design and development using front-end and back-end technologies. Expert in creating interactive and functional solutions.",
    "boton1": "About",
    "boton2": "CV",
    "link-cv": "https://acrobat.adobe.com/id/urn:aaid:sc:VA6C2:58781464-6ec6-4abe-b3a0-9f3e3da4262b"
  },
  "Sobremi": {
    "sobre": "About me",
    "subsobre": "years of experience programming web pages and creating interesting web pages.",
    "conoceme": "Know me better",
    "boton_proyecto": "Project",
    "descripcion": {
      "1": "Hi! I'm Edu, a passionate Full Stack programmer with an exciting journey in the world of web development. I started my journey focusing on the frontend, exploring the wonders of HTML, CSS and JavaScript. My curiosity led me to immerse myself in an intensive program at CoderHouse, where I not only consolidated my existing knowledge but also acquired a high-quality Full Stack skill set.",
      "2": "During my training at CoderHouse, I embarked on the challenging but rewarding career of Full Stack. As I progressed through the career, I was faced with ecommerce-centric projects where I was able to apply my skills to create solid and functional user experiences. The backend became my next challenge, and although it was a more complicated path, I found great satisfaction in overcoming each obstacle.",
      "3": "My academic achievements in Full Stack were outstanding, and I am now at an exciting point in my career, ready to take my skills into the working world. My expertise lies not only in problem-solving and technical development but also in my love for the challenges I face on every project. I am determined to keep learning and constantly improving my skills to excel in the competitive working world of web development."
    }
  },
  "Mishabilidades": {
    "habher": "My skills and tools"
  },
  "Proyecto": {
    "title-project": "PROJECTS",
    "boton": "Review",
    "verMas": "more",
    "menos": "less",
    "code": "code"
  },
  "PROYECTOS": [
    {
      "id": 1,
      "name": "Ecommerce with Firebase",
      "description": "Customize your shopping experience by choosing the type of polo you want and add it to the cart. Upon completing the purchase, you will receive a ticket that is saved in the database.",
      "skills": [
        "Css",
        "React",
        "Material-UI",
        "Axios",
        "Bootstrap",
        "Firebase",
        "Formik",
        "Yup",
        "React Router",
        "JSON Server",
        "SweetAlert2"
      ],
      "img": "/proyectos-img/proyecto1.webp",
      "alt": "Customized polo in shopping cart",
      "href": "https://proyect-react-2.vercel.app/",
      "code": "https://github.com/BigNitgh/Proyect-React-2"
    },
    {
      "id": 2,
      "name": "Full Stack",
      "description": "Manage products, make purchases, and log in with your GitHub account. If you have admin permissions, you can create and delete products.",
      "skills": [
        "Handlebars",
        "CSS",
        "JavaScript",
        "Node.js",
        "Express",
        "MongoDB",
        "Bootstrap",
        "JWT",
        "Swagger",
        "Socket.io",
        "Mongoose",
        "Handlebars",
        "Passport",
        "bcrypt",
        "Winston",
        "Chai",
        "Mocha",
        "Supertest"
      ],
      "img": "/proyectos-img/Proyecto2.webp",
      "alt": "Administrator interface managing products",
      "href": "https://ecommerce-ugl8.onrender.com",
      "code": "https://github.com/BigNight1/Pre-entrega-backend/tree/PracIntEcom"
    },
    {
      "id": 3,
      "name": "ArmalyTech Website",
      "description": "A website dedicated to cell phone repair and other technical services, offering direct contact with the technician.",
      "skills": ["React", "Vite", "Styled-components", "Tailwind", "Flowbite"],
      "img": "/proyectos-img/Armalytech.webp",
      "alt": "ArmalyTech website",
      "href": "https://www.armalytech.com/",
      "code": "https://github.com/BigNight1/WebSite-Armaly"
    }
  ],
  "Copy": {
    "copyright": "Copyright 2023. All Rights to be a Programmer"
  }
}
