{
  "Menu": {
    "Trayectoria": "Trayectoria",
    "Sobre Mi": "Sobre Mí",
    "Proyectos": "Proyectos"
  },
  "TiempodeVida": {
    "Edad": "Edad"
  },
 
  "Presentacion": {
    "presentation": "Hola,Soy Edu",
    "subtitle": "Programador Full Stack",
    "description": "Desarrollador web full stack con experiencia en diseño y desarrollo de aplicaciones web utilizando tecnologías front-end y back-end. Experto en crear soluciones interactivas y funcionales.",
    "boton1": "Sobre Mi",
    "boton2": "HV",
    "link-cv" : "https://acrobat.adobe.com/id/urn%3Aaaid%3Asc%3AVA6C2%3A217f1a6d-6178-49a4-ad22-e04d7cfaccb8/?filetype=application%2Fpdf&viewer%21megaVerb=group-discover"
  },
  "Sobremi": {
    "sobre": "Sobre mi",
    "subsobre": "año de experiencia programando paginas web y creando paginas interesantes",
    "conoceme": "Conóceme más",
    "boton_proyecto": "Proyecto",
    "descripcion": {
      "1": "¡Hola! Soy Edu, un apasionado programador Full Stack con un recorrido emocionante en el mundo del desarrollo web. Comencé mi travesía enfocándome en el frontend, explorando las maravillas de HTML, CSS y JavaScript. Mi curiosidad me llevó a sumergirme en un programa intensivo en CoderHouse, donde no solo consolidé mis conocimientos existentes, sino que también adquirí un conjunto de habilidades Full Stack de alta calidad.",
      "2": "Durante mi formación en CoderHouse, me embarqué en la desafiante pero gratificante carrera de Full Stack. A medida que avanzaba en la carrera, me enfrenté a proyectos centrados en el ecommerce, donde pude aplicar mis habilidades para crear experiencias de usuario sólidas y funcionales. El backend se convirtió en mi próximo desafío, y aunque fue un camino más complicado, encontré una gran satisfacción en superar cada obstáculo.",
      "3": "Mis logros académicos en la carrera Full Stack fueron destacados, y ahora me encuentro en un punto emocionante de mi carrera, listo para llevar mis habilidades al mundo laboral. Mi experiencia no solo se basa en la resolución de problemas y el desarrollo técnico, sino también en mi amor por los desafíos que enfrento en cada proyecto. Estoy decidido a seguir aprendiendo y mejorando constantemente mis habilidades para destacarme en el competitivo mundo laboral del desarrollo web."
    }
  },
  "Mishabilidades": {
    "habher": "Mis habilidades y herramientas"
  },
  "Proyecto":{
    "title-project" : "PROYECTOS",
    "boton": "Revisar",
    "verMas" : "Ver más",
    "menos" : "mostrar menos",
    "code" : "codigo"

  },
  "Copy":{
    "copyright": "Copyright 2023. Todos los Derechos de ser un Programador"
  }
}
